Samples/Output/net10.0/mmd/dependency diagram generator-all.mmd
flowchart LR
  subgraph ddg["Dependency Diagram Generator"]
    direction LR
    ddg_diagramgeneratorsample["DiagramGeneratorSample"]
    ddg_slndependencydiagramgenerator["SlnDependencyDiagramGenerator"]
    ddg_nugetconflictsample["NugetConflictSample"]
  end
  microsoft-netcore-app["Microsoft.NETCore.App"]
  microsoft-extensions-configuration_10-0-8["Microsoft.Extensions.Configuration<br>v10.0.8"]
  microsoft-extensions-configuration-abstractions_10-0-8["Microsoft.Extensions.Configuration.Abstractions<br>v10.0.8"]
  microsoft-extensions-primitives_10-0-8["Microsoft.Extensions.Primitives<br>v10.0.8"]
  microsoft-extensions-configuration-binder_10-0-8["Microsoft.Extensions.Configuration.Binder<br>v10.0.8"]
  microsoft-extensions-configuration-json_10-0-8["Microsoft.Extensions.Configuration.Json<br>v10.0.8"]
  microsoft-extensions-configuration-fileextensions_10-0-8["Microsoft.Extensions.Configuration.FileExtensions<br>v10.0.8"]
  microsoft-extensions-fileproviders-abstractions_10-0-8["Microsoft.Extensions.FileProviders.Abstractions<br>v10.0.8"]
  alloverit-validation_9-2-1["AllOverIt.Validation<br>v9.2.1"]
  fluentvalidation_12-1-1["FluentValidation<br>v12.1.1"]
  microsoft-extensions-dependencyinjection-abstractions_10-0-8["Microsoft.Extensions.DependencyInjection.Abstractions<br>v10.0.8"]
  microsoft-build-locator_1-11-2["Microsoft.Build.Locator<br>v1.11.2"]
  nuget-frameworks_7-6-0["NuGet.Frameworks<br>v7.6.0"]
  nuget-projectmodel_7-6-0["NuGet.ProjectModel<br>v7.6.0"]
  nuget-dependencyresolver-core_7-6-0["NuGet.DependencyResolver.Core<br>v7.6.0"]
  subgraph alloverit-group["AllOverIt"]
      alloverit-group_alloverit_9-2-1["AllOverIt<br>v9.2.1"]
      alloverit-group_alloverit_9-2-0["AllOverIt<br>v9.2.0"]
    end
  subgraph alloverit-assertion-group["AllOverIt.Assertion"]
      alloverit-assertion-group_alloverit-assertion_9-2-1["AllOverIt.Assertion<br>v9.2.1"]
      alloverit-assertion-group_alloverit-assertion_9-2-0["AllOverIt.Assertion<br>v9.2.0"]
    end
  subgraph nuget-protocol-group["NuGet.Protocol"]
      nuget-protocol-group_nuget-protocol_7-6-0["NuGet.Protocol<br>v7.6.0"]
      nuget-protocol-group_nuget-protocol_7-3-1["NuGet.Protocol<br>v7.3.1"]
    end
  subgraph nuget-packaging-group["NuGet.Packaging"]
      nuget-packaging-group_nuget-packaging_7-6-0["NuGet.Packaging<br>v7.6.0"]
      nuget-packaging-group_nuget-packaging_7-3-1["NuGet.Packaging<br>v7.3.1"]
    end
  ddg_diagramgeneratorsample --> microsoft-netcore-app
  ddg_diagramgeneratorsample --> microsoft-extensions-configuration_10-0-8
  microsoft-extensions-configuration_10-0-8 --> microsoft-extensions-configuration-abstractions_10-0-8
  microsoft-extensions-configuration_10-0-8 --> microsoft-extensions-primitives_10-0-8
  ddg_diagramgeneratorsample --> microsoft-extensions-configuration-binder_10-0-8
  microsoft-extensions-configuration-binder_10-0-8 --> microsoft-extensions-configuration_10-0-8
  microsoft-extensions-configuration-binder_10-0-8 --> microsoft-extensions-configuration-abstractions_10-0-8
  ddg_diagramgeneratorsample --> microsoft-extensions-configuration-json_10-0-8
  microsoft-extensions-configuration-json_10-0-8 --> microsoft-extensions-configuration_10-0-8
  microsoft-extensions-configuration-json_10-0-8 --> microsoft-extensions-configuration-abstractions_10-0-8
  microsoft-extensions-configuration-json_10-0-8 --> microsoft-extensions-configuration-fileextensions_10-0-8
  microsoft-extensions-configuration-json_10-0-8 --> microsoft-extensions-fileproviders-abstractions_10-0-8
  ddg_diagramgeneratorsample --> ddg_slndependencydiagramgenerator
  ddg_slndependencydiagramgenerator --> alloverit-group_alloverit_9-2-1
  alloverit-group_alloverit_9-2-1 --> alloverit-assertion-group_alloverit-assertion_9-2-1
  ddg_slndependencydiagramgenerator --> alloverit-validation_9-2-1
  alloverit-validation_9-2-1 --> alloverit-group_alloverit_9-2-1
  alloverit-validation_9-2-1 --> fluentvalidation_12-1-1
  alloverit-validation_9-2-1 --> microsoft-extensions-dependencyinjection-abstractions_10-0-8
  ddg_slndependencydiagramgenerator --> microsoft-build-locator_1-11-2
  ddg_slndependencydiagramgenerator --> nuget-frameworks_7-6-0
  ddg_slndependencydiagramgenerator --> nuget-projectmodel_7-6-0
  nuget-projectmodel_7-6-0 --> nuget-dependencyresolver-core_7-6-0
  ddg_slndependencydiagramgenerator --> nuget-protocol-group_nuget-protocol_7-6-0
  nuget-protocol-group_nuget-protocol_7-6-0 --> nuget-packaging-group_nuget-packaging_7-6-0
  ddg_slndependencydiagramgenerator --> microsoft-netcore-app
  ddg_nugetconflictsample --> microsoft-netcore-app
  ddg_nugetconflictsample --> alloverit-group_alloverit_9-2-0
  alloverit-group_alloverit_9-2-0 --> alloverit-assertion-group_alloverit-assertion_9-2-0
  ddg_nugetconflictsample --> nuget-protocol-group_nuget-protocol_7-3-1
  nuget-protocol-group_nuget-protocol_7-3-1 --> nuget-packaging-group_nuget-packaging_7-3-1
  style ddg fill:#E7EBFC,stroke:#E7EBFC,stroke-width:1px,opacity:1
  style alloverit-group fill:#E7EBFC,stroke:#E7EBFC,stroke-width:1px,opacity:1
  style alloverit-assertion-group fill:#E7EBFC,stroke:#E7EBFC,stroke-width:1px,opacity:1
  style nuget-protocol-group fill:#E7EBFC,stroke:#E7EBFC,stroke-width:1px,opacity:1
  style nuget-packaging-group fill:#E7EBFC,stroke:#E7EBFC,stroke-width:1px,opacity:1
  style microsoft-netcore-app fill:#ECCBC0,opacity:0.8
  style microsoft-extensions-configuration_10-0-8 fill:#ADD8E6,opacity:0.8
  style microsoft-extensions-configuration-abstractions_10-0-8 fill:#FFEC96,opacity:0.8
  style microsoft-extensions-primitives_10-0-8 fill:#FFEC96,opacity:0.8
  style microsoft-extensions-configuration-binder_10-0-8 fill:#ADD8E6,opacity:0.8
  style microsoft-extensions-configuration-json_10-0-8 fill:#ADD8E6,opacity:0.8
  style microsoft-extensions-configuration-fileextensions_10-0-8 fill:#FFEC96,opacity:0.8
  style microsoft-extensions-fileproviders-abstractions_10-0-8 fill:#FFEC96,opacity:0.8
  style alloverit-group_alloverit_9-2-1 fill:#ADD8E6,opacity:0.8
  style alloverit-assertion-group_alloverit-assertion_9-2-1 fill:#FFEC96,opacity:0.8
  style alloverit-validation_9-2-1 fill:#ADD8E6,opacity:0.8
  style fluentvalidation_12-1-1 fill:#FFEC96,opacity:0.8
  style microsoft-extensions-dependencyinjection-abstractions_10-0-8 fill:#FFEC96,opacity:0.8
  style microsoft-build-locator_1-11-2 fill:#ADD8E6,opacity:0.8
  style nuget-frameworks_7-6-0 fill:#ADD8E6,opacity:0.8
  style nuget-projectmodel_7-6-0 fill:#ADD8E6,opacity:0.8
  style nuget-dependencyresolver-core_7-6-0 fill:#FFEC96,opacity:0.8
  style nuget-protocol-group_nuget-protocol_7-6-0 fill:#ADD8E6,opacity:0.8
  style nuget-packaging-group_nuget-packaging_7-6-0 fill:#FFEC96,opacity:0.8
  style alloverit-group_alloverit_9-2-0 fill:#ADD8E6,opacity:0.8
  style alloverit-assertion-group_alloverit-assertion_9-2-0 fill:#FFEC96,opacity:0.8
  style nuget-protocol-group_nuget-protocol_7-3-1 fill:#ADD8E6,opacity:0.8
  style nuget-packaging-group_nuget-packaging_7-3-1 fill:#FFEC96,opacity:0.8
